src/Documents/ПоступлениеНаСчет/ПоступлениеНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="122f9628-1dc8-4c27-9883-60c9b12afd14">
  <name>ПоступлениеНаСчет</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1845762c-f230-4d58-b262-78aff6558f75">
    <name>Патент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

src/Catalogs/Патенты/Патенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="744a0b3f-afcc-4c8d-9380-83b6721c4056">
  <name>Патенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="4d629a29-d51e-441c-86dd-84f17e6aa3fb">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dc530737-bd30-4efb-a91d-867e93039419">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/Documents/ПоступлениеНаСчет/ObjectModule.bsl
&После("ПередЗаписью")
Процедура am_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Патенты.Ссылка КАК Ссылка,
	               |	Патенты.ВерсияДанных КАК ВерсияДанных,
	               |	Патенты.ПометкаУдаления КАК ПометкаУдаления,
	               |	Патенты.Код КАК Код,
	               |	Патенты.Наименование КАК Наименование,
	               |	Патенты.ДатаНачала КАК ДатаНачала,
	               |	Патенты.ДатаОкончания КАК ДатаОкончания,
	               |	Патенты.Предопределенный КАК Предопределенный,
	               |	Патенты.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	               |ИЗ
	               |	Справочник.Патенты КАК Патенты
	               |ГДЕ
	               |	Патенты.ДатаНачала <= &ТекДата
	               |	И Патенты.ДатаОкончания >= &ТекДата";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Патент = Справочники.Патенты.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Патент = Выборка.Ссылка;
	КонецЕсли;
КонецПроцедуры
